chenyurong22/STM32F769i-DISCO/STM32F769I-DISCO_ConfigLCD/Core/Src/main.c
/* USER CODE BEGIN Header */
/**
 ******************************************************************************
 * @file           : main.c
 * @brief          : Main program body
 ******************************************************************************
 * @attention
 *
 * Copyright (c) 2026 STMicroelectronics.
 * All rights reserved.
 *
 * This software is licensed under terms that can be found in the LICENSE file
 * in the root directory of this software component.
 * If no LICENSE file comes with this software, it is provided AS-IS.
 *
 ******************************************************************************
 */
/* USER CODE END Header */
/* Includes ------------------------------------------------------------------*/
#include "main.h"
#include "string.h"
#include "cmsis_os.h"

/* Private includes ----------------------------------------------------------*/
/* USER CODE BEGIN Includes */

#include "stm32f769i_discovery_lcd.h"
#include "stm32f769i_discovery_ts.h"

#include "custom.h"
#include "customLCD.h"
#include "customACCL.h"
#include <stdint.h>
#include <stdio.h>
#include <strings.h>

/* UNICODE char : Ctrl + Shift + U
 * 270D:	Writing hand ✍
 * 2705:	White Heavy Check Mark ✅
 * 274E:	Negative squared cross mark ❎
 * 274C:	Cross mark ❌
 * 2753:	Black question mark ornament ❓
 * 2757:	Heavy exclamation mark symbol ❗
/* USER CODE END Includes */

/* Private typedef -----------------------------------------------------------*/
/* USER CODE BEGIN PTD */

TS_StateTypeDef TS_State;
volatile uint8_t TOUCH_ON = 0;
volatile uint8_t touchCount = 0;

volatile uint16_t pixelXY[2] = { 0 };

HAL_StatusTypeDef test;

/* USER CODE END PTD */

/* Private define ------------------------------------------------------------*/
/* USER CODE BEGIN PD */

#define LCD_FRAME_BUFFER  0xC0000000

/* USER CODE END PD */

/* Private macro -------------------------------------------------------------*/
/* USER CODE BEGIN PM */

/* USER CODE END PM */

/* Private variables ---------------------------------------------------------*/
#if defined ( __ICCARM__ ) /*!< IAR Compiler */
#pragma location=0x2007c000
ETH_DMADescTypeDef  DMARxDscrTab[ETH_RX_DESC_CNT]; /* Ethernet Rx DMA Descriptors */
#pragma location=0x2007c0a0
ETH_DMADescTypeDef  DMATxDscrTab[ETH_TX_DESC_CNT]; /* Ethernet Tx DMA Descriptors */

#elif defined ( __CC_ARM )  /* MDK ARM Compiler */

__attribute__((at(0x2007c000))) ETH_DMADescTypeDef  DMARxDscrTab[ETH_RX_DESC_CNT]; /* Ethernet Rx DMA Descriptors */
__attribute__((at(0x2007c0a0))) ETH_DMADescTypeDef  DMATxDscrTab[ETH_TX_DESC_CNT]; /* Ethernet Tx DMA Descriptors */

#elif defined ( __GNUC__ ) /* GNU Compiler */

ETH_DMADescTypeDef DMARxDscrTab[ETH_RX_DESC_CNT] __attribute__((section(".RxDecripSection"))); /* Ethernet Rx DMA Descriptors */
ETH_DMADescTypeDef DMATxDscrTab[ETH_TX_DESC_CNT] __attribute__((section(".TxDecripSection")));   /* Ethernet Tx DMA Descriptors */
#endif

ETH_TxPacketConfig TxConfig;

CRC_HandleTypeDef hcrc;

DMA2D_HandleTypeDef hdma2d;

DSI_HandleTypeDef hdsi;

LTDC_HandleTypeDef hltdc;

QSPI_HandleTypeDef hqspi;

RTC_HandleTypeDef hrtc;

SAI_HandleTypeDef hsai_BlockA1;
SAI_HandleTypeDef hsai_BlockB1;
SAI_HandleTypeDef hsai_BlockA2;

SPDIFRX_HandleTypeDef hspdif;

UART_HandleTypeDef huart1;

SDRAM_HandleTypeDef hsdram1;

osThreadId defaultTaskHandle;
/* USER CODE BEGIN PV */

/* USER CODE END PV */

/* Private function prototypes -----------------------------------------------*/
void SystemClock_Config(void);
void PeriphCommonClock_Config(void);
static void MPU_Config(void);
static void MX_GPIO_Init(void);
static void MX_CRC_Init(void);
static void MX_DMA2D_Init(void);
static void MX_DSIHOST_DSI_Init(void);
static void MX_FMC_Init(void);
static void MX_LTDC_Init(void);


static void MX_USART1_UART_Init(void);
static void MX_QUADSPI_Init(void);
void StartDefaultTask(void const * argument);

/* USER CODE BEGIN PFP */

/* USER CODE END PFP */

/* Private user code ---------------------------------------------------------*/
/* USER CODE BEGIN 0 */

/* USER CODE END 0 */

/**
  * @brief  The application entry point.
  * @retval int
  */
int main(void)
{

  /* USER CODE BEGIN 1 */

	uint8_t bCount = 0;
	char aCountMsg[MAX_ARR_SIZE];
	/* USER CODE END 1 */

  /* MPU Configuration--------------------------------------------------------*/
  MPU_Config();
  MPU_SDRAM_Config();

  /* MCU Configuration--------------------------------------------------------*/

  /* Reset of all peripherals, Initializes the Flash interface and the Systick. */
  HAL_Init();

  /* USER CODE BEGIN Init */

  /* USER CODE END Init */

  /* Configure the system clock */
  SystemClock_Config();

  /* Configure the peripherals common clocks */
  PeriphCommonClock_Config();

  /* USER CODE BEGIN SysInit */

  /* USER CODE END SysInit */

  /* Initialize all configured peripherals */
  MX_GPIO_Init();
  MX_DMA2D_Init();
  MX_DSIHOST_DSI_Init();
  MX_USART1_UART_Init();

  MX_FMC_Init();
  BSP_SDRAM_Init();

  MX_LTDC_Init();
  BSP_LCD_Init();

  /* Initializing Touch Sensor */
  BSP_TS_Init(800, 480);
  BSP_TS_INT_MspInit();

  /* USER CODE BEGIN 2 */
	/* Testing UART log with assert_param() */
	//assert_param(2>3);

	uint8_t *pMsg = "Welcome to STM32F769i-DISCO \r\n";

	uint8_t *pMsgOFF = "Display OFF. Turning ON in 3 sec .. \r\n";
	uint8_t *pMsgON = "Display ON \r\n";
	uint8_t aCordinate[30];

	writetoSerial(&huart1, (char*)pMsg);

	BSP_LCD_LayerDefaultInit(0, LCD_FRAME_BUFFER);

	BSP_LCD_SelectLayer(0);
	BSP_LCD_Clear(LCD_COLOR_DARKGREEN);
	BSP_LCD_SetFont(&Font24);

	BSP_LCD_SetTextColor(LCD_COLOR_BLUE);
	BSP_LCD_SetBackColor(LCD_COLOR_GREEN);

	/* Display OFF -> ON */
	uint32_t getCurtime = HAL_GetTick();

	uint8_t nt35510_OFF[] = { 0x28, 0x00 };
	uint8_t nt35510_ON[] = { 0x29, 0x00 };

